#include <stdio.h>
int main ()
{
float a;
printf("Введите число\n");
scanf("%f",&a); // для ввода %f %e %g тип float  %lf %lg %le тип double
printf("lf:\n"); 
printf("%lf\n",a); // вещественный формат выводит в десятичной форме 
printf("lg:\n");
printf("%lg\n",a); // смешанный формат выводит в зависимости от числа либо в экспоненциальной либо в десятичной форме
printf("le:\n");
printf("%le\n",a); //выводит в экспоненциальной форме 
printf("f:\n");
printf("%f\n",a); // вещественный формат выводит в десятичной форме 
printf("e:\n");
printf("%e\n",a); //выводит в экспоненциальной форме 
printf("g:\n");
printf("%g\n",a); // смешанный формат выводит в зависимости от числа либо в экспоненциальной либо в десятичной форме
return 0;
}
