#include <stdio.h>
void printBits_double(void *a) //функция которая представляет числа с плавающей точкой в битовом представлении
{
	int i; unsigned long long x;
	x=*(unsigned long long *)a;
	for(i=63;i>=0;i--)
	{ if((x & ((unsigned long long)1<<i))!=0) printf("1");
		else printf("0");
		if(i==63) printf(" ");
		if(i==52) printf(" ");
		}
	}
int main ()
{
double a=16.0; // переменная которая является степенью двойки 
int i=4; //соответствующая степень 
do //сначала выполняется цикл do потом  он делает проверку условия while то есть этот цикл запустится минимум 1 раз
{
printf("%d: %le=\t",i,a); 
printBits_double(&a); //вызов функции для битового представления числа 
printf("\n");
a/=2.0; /*делим  нашу переменную на 2 тем самым понижая ее степень на 1 когда экспонента станет слишком маленькой ее невозможно будет представить в 
нормализованной форме и число перейдет в денормализованное */
i--; // уменьшаем нашу степень на 1 для правильного вывода в printf 
}
while( a>0 ); //цикл будет выполняться пока a>0
return 0;
}
